<a href="https://colab.research.google.com/github/maincarey/ML/blob/master/linearreg2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
# features independent variables - features   dependent is price on housing stats

In [0]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [0]:
df = pd.read_csv('/content/sample_data/homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [0]:
# Data Preprocessing: Fill NA values with median value of a column
import math
df.bedrooms.median()

4.0

In [0]:
# fill na data with  a median number
df.bedrooms = df.bedrooms.fillna(df.bedrooms.median())
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [0]:
# linear reg class object
reg = linear_model.LinearRegression()
# fit model
reg.fit(df.drop('price',axis='columns'),df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [0]:
# the coef below are m1 m2 m3 in price = (m1 * area) + (m2 * beds) + (m3 * age) + b
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [0]:
# this is b variable
reg.intercept_

221323.00186540396

In [0]:
#Find price of home with 3000 sqr ft area, 3 bedrooms, 40 year old
reg.predict([[3000, 3, 40]])

array([498408.25158031])